CREATE TABLE категория (
    id SERIAL PRIMARY KEY,
    название VARCHAR(100) NOT NULL
);

CREATE TABLE пользователь (
    id INTEGER PRIMARY KEY,
    фамилия VARCHAR(50) NOT NULL,
    имя VARCHAR(50) NOT NULL,
    отчество VARCHAR(50),
    логин VARCHAR(50) NOT NULL,
    пароль VARCHAR(100) NOT NULL,
    пин_код VARCHAR(10)
);

CREATE TABLE платеж (
    id SERIAL PRIMARY KEY,
    дата TIMESTAMP NOT NULL,
    id_категории INTEGER REFERENCES категория(id),
    наименование_платежа VARCHAR(100) NOT NULL,
    количество NUMERIC(10, 2) DEFAULT 1,
    цена NUMERIC(10, 2) NOT NULL,
    стоимость NUMERIC(10, 2) GENERATED ALWAYS AS (количество * цена) STORED
);

INSERT INTO категория (название) VALUES 
('Коммунальные платежи'),
('Автомобиль'),
('Питание и быт'),
('Медицина'),
('Разное');

INSERT INTO пользователь (id, фамилия, имя, отчество, логин, пароль, пин_код) VALUES
(1, 'Бойко', 'Игорь', 'Петрович', 'Boico', 'aut_aliasg', '6039'),
(2, 'Василенко', 'Василий', 'Александрович', 'Vasilenco', 'qwerty', '8797'),
(3, 'Контеенко', 'Дмитрий', 'Семенович', 'Konteenco', 'placeat1972l', '0961'),
(4, 'Лазарьков', 'Петр', 'Михайлович', 'Lazarkov', 'equam442', '4842'),
(5, 'Кузнецов', 'Василий', 'Семенович', 'Kuznetsov', 'libero%88f', '8720'),
(6, 'Дорофеева', 'Анна', 'Геннадьевна', 'Test', '12345', '9812'),
(7, 'Прокопьева', 'Елена', 'Петровна', 'Ann', 'porro_autu', '9553');


DO $$
DECLARE
    комм_платежи_id INTEGER;
    автомобиль_id INTEGER;
    питание_быт_id INTEGER;
    медицина_id INTEGER;
    разное_id INTEGER;
BEGIN
    SELECT id INTO комм_платежи_id FROM категория WHERE название = 'Коммунальные платежи';
    SELECT id INTO автомобиль_id FROM категория WHERE название = 'Автомобиль';
    SELECT id INTO питание_быт_id FROM категория WHERE название = 'Питание и быт';
    SELECT id INTO медицина_id FROM категория WHERE название = 'Медицина';
    SELECT id INTO разное_id FROM категория WHERE название = 'Разное';

    INSERT INTO платеж (дата, id_категории, наименование_платежа, количество, цена) VALUES
    ('2016-11-01 00:00:00', комм_платежи_id, 'Квартплата', 1, 2964.58),
    ('2016-11-01 00:00:00', комм_платежи_id, 'Интернет', 1, 450),
    ('2016-11-01 00:00:00', комм_платежи_id, 'Телефон', 1, 170),
    ('2016-11-01 00:00:00', комм_платежи_id, 'Мобильный', 1, 300),
    ('2016-11-01 00:00:00', комм_платежи_id, 'Электроэнергия', 1, 184),
    ('2016-11-01 00:00:00', комм_платежи_id, 'Газоснабжение', 1, 3120),
    ('2016-11-01 00:00:00', комм_платежи_id, 'Водоснабжение', 1, 16.41),
    ('2016-11-01 00:00:00', автомобиль_id, 'Взнос за гараж', 1, 5000),
    ('2016-11-30 00:00:00', автомобиль_id, 'Бензин', 1, 2238),
    ('2016-11-01 00:00:00', питание_быт_id, 'Сметана', 1, 45),
    ('2016-11-02 00:00:00', питание_быт_id, 'Томатный сок', 1, 15),
    ('2016-11-03 00:00:00', питание_быт_id, 'Губка для обуви', 1, 40),
    ('2016-11-04 00:00:00', питание_быт_id, 'Еда', 1, 159.2),
    ('2016-11-05 00:00:00', питание_быт_id, 'Булочки и тесто', 1, 240),
    ('2016-11-06 00:00:00', питание_быт_id, 'Творог и сметана', 1, 94.96),
    ('2016-11-07 00:00:00', питание_быт_id, 'Семечки', 2, 35),
    ('2016-11-08 00:00:00', питание_быт_id, 'Хачапури и морс', 1, 82),
    ('2016-11-09 00:00:00', питание_быт_id, 'Столовая', 1, 119.93),
    ('2016-11-10 00:00:00', питание_быт_id, 'Столовая', 1, 127.66),
    ('2016-11-11 00:00:00', питание_быт_id, 'Еда', 1, 258.84),
    ('2016-11-12 00:00:00', питание_быт_id, 'Еда', 1, 213.31),
    ('2016-11-13 00:00:00', питание_быт_id, 'Еда', 1, 137.18),
    ('2016-11-14 00:00:00', питание_быт_id, 'Еда', 1, 127.82),
    ('2016-11-15 00:00:00', питание_быт_id, 'Еда', 1, 195.39),
    ('2016-11-16 00:00:00', питание_быт_id, 'Гипермаркет', 1, 3726),
    ('2016-11-17 00:00:00', питание_быт_id, 'Гипермаркет', 1, 2484),
    ('2016-11-18 00:00:00', питание_быт_id, 'Макароны', 1, 33),
    ('2016-11-19 00:00:00', питание_быт_id, 'Еда', 1, 144.75),
    ('2016-11-20 00:00:00', питание_быт_id, 'Еда', 1, 138.73),
    ('2016-11-21 00:00:00', питание_быт_id, 'Еда', 1, 24),
    ('2016-11-22 00:00:00', питание_быт_id, 'Еда', 1, 261.21),
    ('2016-11-23 00:00:00', питание_быт_id, 'Столовая', 1, 19.42),
    ('2016-11-24 00:00:00', питание_быт_id, 'Еда', 1, 80),
    ('2016-11-25 00:00:00', питание_быт_id, 'Столовая', 1, 58.86),
    ('2016-11-26 00:00:00', питание_быт_id, 'Еда', 1, 82),
    ('2016-11-27 00:00:00', питание_быт_id, 'Еда', 1, 81),
    ('2016-11-01 00:00:00', медицина_id, 'Прием врача', 1, 450),
    ('2016-11-03 00:00:00', медицина_id, 'Прием врача', 1, 400),
    ('2016-11-05 00:00:00', медицина_id, 'Прием врача', 1, 330),
    ('2016-11-07 00:00:00', медицина_id, 'ЭКГ', 1, 455),
    ('2016-11-09 00:00:00', медицина_id, 'Анализы', 1, 280),
    ('2016-11-11 00:00:00', медицина_id, 'Прием врача', 1, 220),
    ('2016-11-13 00:00:00', медицина_id, 'Контейнер для анализов', 1, 20),
    ('2016-11-15 00:00:00', медицина_id, 'Лекарства', 1, 449.5),
    ('2016-11-17 00:00:00', медицина_id, 'Лекарства', 1, 202.4),
    ('2016-11-19 00:00:00', медицина_id, 'Прием врача', 1, 800),
    ('2016-11-21 00:00:00', медицина_id, 'Прием врача', 1, 400),
    ('2016-11-23 00:00:00', медицина_id, 'Анализы', 1, 1740),
    ('2016-11-25 00:00:00', медицина_id, 'Термометр для ванн', 1, 152.5),
    ('2016-11-27 00:00:00', медицина_id, 'Юниспорт', 1, 3500),
    ('2016-11-01 00:00:00', разное_id, 'Туфли', 1, 699),
    ('2016-11-04 00:00:00', разное_id, 'Диски, кейс, стяжки', 1, 933),
    ('2016-11-07 00:00:00', разное_id, 'Маникюр', 1, 550),
    ('2016-11-10 00:00:00', разное_id, 'Ушивание брюк', 1, 150),
    ('2016-11-13 00:00:00', разное_id, 'Одежда', 1, 2871.84),
    ('2016-11-16 00:00:00', разное_id, 'Плавательный набор', 1, 1040),
    ('2016-11-19 00:00:00', разное_id, 'CD', 1, 165),
    ('2016-11-22 00:00:00', разное_id, 'Маркеры', 1, 120),
    ('2016-11-25 00:00:00', разное_id, 'Организационный сбор', 2, 500);
END $$;

CREATE TABLE платежи_пользователей (
    id SERIAL PRIMARY KEY,
    id_пользователя INTEGER NOT NULL REFERENCES пользователь(id),
    id_платежа INTEGER NOT NULL REFERENCES платеж(id)
);

INSERT INTO платежи_пользователей (id_пользователя, id_платежа) VALUES
(1 + floor(random() * 7), 1),
(1 + floor(random() * 7), 2),
(1 + floor(random() * 7), 3),
(1 + floor(random() * 7), 4),
(1 + floor(random() * 7), 5),
(1 + floor(random() * 7), 6),
(1 + floor(random() * 7), 7),
(1 + floor(random() * 7), 8),
(1 + floor(random() * 7), 9),
(1 + floor(random() * 7), 10),
(1 + floor(random() * 7), 11),
(1 + floor(random() * 7), 12),
(1 + floor(random() * 7), 13),
(1 + floor(random() * 7), 14),
(1 + floor(random() * 7), 15),
(1 + floor(random() * 7), 16),
(1 + floor(random() * 7), 17),
(1 + floor(random() * 7), 18),
(1 + floor(random() * 7), 19),
(1 + floor(random() * 7), 20),
(1 + floor(random() * 7), 21),
(1 + floor(random() * 7), 22),
(1 + floor(random() * 7), 23),
(1 + floor(random() * 7), 24),
(1 + floor(random() * 7), 25),
(1 + floor(random() * 7), 26),
(1 + floor(random() * 7), 27),
(1 + floor(random() * 7), 28),
(1 + floor(random() * 7), 29),
(1 + floor(random() * 7), 30),
(1 + floor(random() * 7), 31),
(1 + floor(random() * 7), 32),
(1 + floor(random() * 7), 33),
(1 + floor(random() * 7), 34),
(1 + floor(random() * 7), 35),
(1 + floor(random() * 7), 36),
(1 + floor(random() * 7), 37),
(1 + floor(random() * 7), 38),
(1 + floor(random() * 7), 39),
(1 + floor(random() * 7), 40),
(1 + floor(random() * 7), 41),
(1 + floor(random() * 7), 42),
(1 + floor(random() * 7), 43),
(1 + floor(random() * 7), 44),
(1 + floor(random() * 7), 45),
(1 + floor(random() * 7), 46),
(1 + floor(random() * 7), 47),
(1 + floor(random() * 7), 48),
(1 + floor(random() * 7), 49),
(1 + floor(random() * 7), 50),
(1 + floor(random() * 7), 51),
(1 + floor(random() * 7), 52),
(1 + floor(random() * 7), 53),
(1 + floor(random() * 7), 54),
(1 + floor(random() * 7), 55),
(1 + floor(random() * 7), 56),
(1 + floor(random() * 7), 57),
(1 + floor(random() * 7), 58),
(1 + floor(random() * 7), 59);